Repository: 84000/data-translation-memory
Catalog: toh153_84000-the-questions-of-the-naga-king-sagara-1-.tmx
Source language: bo
Languages: en

source: བཟོད་པ་གང་སྒོམ་པ་ན་བདག་དང་སེམས་ཅན་དང་། སྲོག་དང་གང་ཟག་ཏུ་མི་དམིགས་ཤིང་།
en: The patience that they cultivate is one that does not apprehend the self, being, life force, or a person.

source: ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་ཡང་མི་གནས་པ་དེ་ནི་ནང་དག་པ་དང་། སེམས་ཅན་དག་པ་དང་། ཆོས་ཐམས་ཅད་དག་པས་བཟོད་པ་སྒོམ་པ་ཡིན་ཏེ།
en: It is not grounded in clinging to me and mine . It is patience that is cultivated through inner purity, the purity of beings, and the purity of all phenomena.

source: དེ་ནི་བཟོད་པ་ཡང་སྒོམ་ལ། ཆོས་གང་ཡང་སྒོམ་པར་མི་བྱེད། མི་སྒོམ་པར་ཡང་མི་བྱེད་ལ།
en: While cultivating patience, they neither meditate on nor fail to meditate on any phenomena;

source: ཆོས་གང་ཡང་བསྐྱེད་པའི་ཕྱིར་རམ་དགག་པར་བྱ་བའི་ཕྱིར་ཡང་སྒོམ་པར་མི་བྱེད།
en: they do not meditate on phenomena in order to create or prevent any phenomena;

source: ཆོས་གང་ཡང་ཟད་པར་བྱ་བའི་ཕྱིར་རམ། ཉེ་བར་ཞི་བར་བྱ་བའི་ཕྱིར་ཡང་སྒོམ་པར་མི་བྱེད།
en: and they do not meditate on phenomena in order to exhaust or quell any phenomena.

source: སེམས་ཅན་བདག་མེད་པ་དང་། སེམས་ཅན་དབེན་པས་ཀྱང་མི་སྐྲག་མི་དངང་དངང་བར་མི་འགྱུར་ལ་བཟོད་པ་དེ་ཡང་ལུས་ལ་དམིགས་པ་དང་། ངག་ལ་དམིགས་པ་དང་། སེམས་ལ་དམིགས་པས་བཟོད་པར་མི་བྱེད་པ་དང་། དེ་ལུས་བཤིག་པའམ།
en: Given the fact that beings are selfless and void, they are not scared or frightened and will not become so. Moreover, this patience is not performed while observing body, speech, or mind.

source: ཡན་ལག་དང་། ཉིང་ལག་རྣམས་གཅོད་པ་ན་རྩྭ་དང་། ཤིང་དང་རྩིག་པ་དང་འདྲ་བར་སོ་སོར་རྟོག་ཅིང་བཟོད་པ་དང་། དེ་གཞན་གྱིས་ངན་དུ་སྨྲས་པ་ཐོས་ན་ངག་ཡ་མ་བརླ་དང་ངག་གསོབ་དང་ངག་གསོག་དང་། ངག་གཟུང་དུ་མེད་པ་དང་། ངག་ཞི་བ་དང་། ངག་མི་གནས་པར་ཤེས་ནས་བཟོད་པ་དང་། དེ་སེམས་རྙོག་པ་མེད་པ་དང་། སེམས་གསར་མ་ཡིན་པ་དང་། སེམས་རྙིང་མ་ཡིན་པ་དང་། གཅིག་ལ་གཅིག་མཚམས་སྦྱོར་བ་མེད་པ་དང་། སྐད་ཅིག་གིས་འཇིག་པས་མེད་པར་འགྱུར་བར་སོ་སོར་རྟོག་ཅིང་བཟོད་ལ།
en: When the body is destroyed or their limbs and digits are cut off, they will accept it and regard them as being like grass, trees, or walls. If they hear another speaking ill, they will accept it knowing that speech itself is hollow, void, empty, insubstantial, peaceful, and nonabiding. They practice patience by understanding that the mind is not turbid, new, or old, is without connection, and does not exist because of perishing momentarily.

source: མཚམས་སྦྱོར་བ་མེད་པར་མཐོང་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་བཟོད་པ་ཞེས་བྱའོ།
en: To see this absence of continuity is the bodhisattvas’ practice of patience that is grounded in insight.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་བརྩོན་འགྲུས་གང་ཞེ་ན།
en: “Next, what is the bodhisattvas’ diligence that is grounded in insight?

source: བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་རྣམ་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་ཀྱང་རྩོམ་ལ།
en: Bodhisattvas engage in diligence in order to multiply their roots of virtue.

source: བརྩོན་འགྲུས་རྣམ་པར་འཕེལ་བ་དེས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་རྣམ་པར་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་གང་ཡིན་པ་དང་། དེས་ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་སུ་ཡང་དག་པར་འདུ་བར་རིག་ནས་ཆོས་གང་ཡང་བདེན་པར་ཡོངས་སུ་གྲུབ་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ལ།
en: Yet such increasing of diligence does not cause them to perceive any increase or decrease with regard to the realm of phenomena. Knowing all phenomena to be contained within the realm of phenomena, they do not perceive any phenomena whatsoever to be truly existent.

source: མི་བདེན་པ་ཕྱིན་ཅི་ལོག་ལ་འཇིག་རྟེན་གནས་པ་ཡང་མཐོང་བ་དང་། དེས་དེ་ལྟར་ཤེས་རབ་རྣམ་པར་དག་པའི་སྒོ་ནས་ཆོས་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བ་ན་ཆོས་རྣམས་འཕེལ་བར་ཡང་མི་བྱེད། འགྲིབ་པ་ཡང་མི་བྱེད་པ་དང་། ཆོས་ཐམས་ཅད་སྤུངས་པའི་རང་བཞིན་མ་ཡིན་པ་དང་། ཡུལ་ན་མི་གནས་པ་དང་། ཕྱོགས་ན་མི་གནས་པ་དང་། གང་ནས་ཀྱང་མི་འོང་བ་དང་། གང་དུ་ཡང་མི་འགྲོ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: Rather, they perceive all phenomena of the world to be false and mistaken. In this way, when bodhisattvas look to any phenomenon with pure insight, they know that phenomena cannot be made to increase or decrease, that phenomena are not of an aggregated nature, that they are not present in any place or direction, and that they do not come from anywhere or go anywhere.

source: དེ་དེ་ལྟ་བུའི་ཆོས་དང་ལྡན་པས་ཕྱིན་ཅི་ལོག་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་ཤེས་པར་བྱ་བའི་ཕྱིར། སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པའི་བརྩོན་འགྲུས་རྩོམ་ལ།
en: Because their diligence has this quality, bodhisattvas diligently teach the Dharma to all beings to make them understand what is mistaken and what is true.

source: སེམས་ཅན་དེ་དག་ཀྱང་ཡང་དག་པར་མི་དམིགས་ཏེ།
en: Yet they do not truly apprehend any such beings.

source: སེམས་ཅན་མི་དམིགས་པ་གང་ཡིན་པ་དེ་ཉིད་དེའི་ཆོས་ཐམས་ཅད་མི་དམིགས་པའོ།
en: Not apprehending any beings, they also do not apprehend any phenomena.

source: སེམས་ཅན་ལ་མ་གཏོགས་པའི་ཆོས་གང་ཡང་མེད་པ་ལ། ཆོས་ལ་མ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཀྱང་མེད་མོད་ཀྱི།
en: There are no phenomena separate from beings, nor are there any beings separate from phenomena.

source: འོན་ཀྱང་ཆོས་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་བདག་གི་ངོ་བོ་ཉིད་དོ།
en: Still, the essential nature of phenomena is also the essential nature of the self.

source: །བདག་གི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: The essential nature of the self is the essential nature of all phenomena.

source: །ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: The essential nature of all phenomena is the essential nature of the qualities of buddhahood.

source: །ངོ་བོ་ཉིད་མཉམ་པ་ཉིད་འདིས་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཚོལ་བ་གང་ཡིན་པ་དང་། བཙལ་ནས་ཀྱང་ཆོས་ཀྱང་མི་དམིགས།
en: All the qualities of buddhahood are sought through this sameness of the essential nature, so even in seeking them, no such qualities are apprehended, and nothing that is not a quality of buddhahood is apprehended.

source: ཆོས་མ་ཡིན་པ་ཡང་མི་དམིགས་པ་དང་། ཚོལ་བ་ན་ཡང་གང་གིས་བཙལ་བ་དང་། གང་བཙལ་བ་དང་། སུས་བཙལ་བ་དེ་དག་ཐམས་ཅད་མི་དམིགས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་བརྩོན་འགྲུས་ཞེས་བྱའོ།
en: Even when they seek, bodhisattvas do not apprehend any searching, anything being sought, or anyone seeking. This is how the bodhisattvas’ diligence that is grounded in insight is described.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་བསམ་གཏན་གང་ཞེ་ན།
en: “What is the bodhisattvas’ concentration that is grounded in insight?

source: བསམ་གཏན་རྣམས་ལ་ཡང་སྙོམས་པར་འཇུག་ལ། མཉམ་པ་ཉིད་ལས་ཀྱང་ཉམས་པར་ཡང་མི་འགྱུར།
en: While settling into concentrations, those concentrations do not decline from sameness, nor do they enhance it.

source: ཕུན་སུམ་ཚོགས་པར་ཡང་མི་འགྱུར་བ་གང་ཡིན་པ་དང་། དེ་བསམ་གཏན་ཀྱང་བསམ་གཏན་དུ་བྱེད་ལ། ཆོས་གང་ཡང་སྐྱེད་པར་ཡང་མི་བྱེད།
en: When bodhisattvas practice concentration, they do not generate or attenuate any phenomena.

source: འབྲི་བར་ཡང་མི་བྱེད་པ་དང་། ཡུལ་ཐམས་ཅད་ལ་ཡང་མི་རྟེན་པར་བསམ་གཏན་བྱེད་ལ།
en: They concentrate without relying on any reference point, and so they concentrate in a way that is neither in accord nor in discord with any phenomena.

source: ཆོས་ཐམས་ཅད་དང་འཐུན་པ་དང་མི་འཐུན་པ་མེད་པར་ཡང་བསམ་གཏན་བྱེད་པ་དང་། ལུས་དང་སེམས་ཀྱིས་ཀྱང་བསམ་གཏན་གྱི་ཡན་ལག་དང་། བསམ་གཏན་གྱི་བསམ་པ་དང་། བསམ་གཏན་གྱི་སྦྱོར་བ་དེ་དག་མངོན་པར་སྒྲུབ་པར་མི་བྱེད་པ་དང་། དེ་སྙོམས་པར་འཇུག་པ་ན་ཅི་ནས་དེ་བཞིན་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱིས་སྙོམས་པར་འཇུག་པ་དེ་ལྟ་བུས་སྙོམས་པར་འཇུག་པ་དང་། དེ་སེམས་ཅན་ཐམས་ཅད་མཉམ་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་ལ་སྒྲོ་མི་འདོགས་པས་སྙོམས་པར་འཇུག་པ་སྟེ།
en: They do not perfect the branches of concentration, the contemplation of concentration, or the applications of concentration through either body or mind. When bodhisattvas reach attainment, that attainment is similar to attainment reached through thusness, the limit of reality, and the realm of phenomena. They reach attainment because of the equality of all beings and the absence of superimposition about phenomena.

source: དེ་དེ་ལྟར་ཏིང་ངེ་འཛིན་སྒོམ་པའི་སྦྱོར་བ་ལ་བརྩོན་པ་ན། ནང་དང་ཕྱི་རོལ་གྱི་ལུས་དང་སེམས་ལ་ཡང་མི་གནས་ལ།
en: As they exert themselves in cultivating absorption, they dwell neither within nor without the body or mind.

source: ཕྱི་རོལ་གྱི་ཡུལ་ལ་ཡང་སེམས་མི་གནས་པ་དེ་ནི་མི་གནས་པའི་རྣམ་པར་ཤེས་པ་སྟེ།
en: The mind that does not dwell on any outer object is a consciousness that remains nowhere; it surpasses all referential attainments.

source: དམིགས་པ་ཅན་གྱི་རང་བཞིན་གྱི་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་གནོན་ལ། ཕྱི་རོལ་གྱི་དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྣམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བསམ་གཏན་དང་། བསམ་གཏན་ལ་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་གནོན་ཏོ།
en: It surpasses the non-Buddhist sages who have the five higher knowledges, all hearers and solitary buddhas, and all states of concentration and attainments of concentration.

source: །དེ་དགེ་བའི་རྩ་བ་རྣམས་དང་། བསམ་གཏན་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཤས་ཆེ་བ་དང་། ལྟ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ་ཡིན་ལ།
en: Its roots of virtue and states of concentration are predominantly characterized by insight and are devoid of all afflicted views.

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པ་ཡང་ཡིན་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་ཡང་སྒྲུབ་པ་ཡིན་ཏེ།
en: It is dedicated to awakening and accomplishes the ripening of beings.

source: དེ་ལྟ་བས་ན་དེ་བཞིན་གཤེགས་པ་ནི་སྙོམས་པར་འཇུག་པ་གཅིག་གིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་མཐའི་བར་དུ་ཐུག་པར་མཛད་དེ།
en: In this way, through a single meditative attainment, a thus-gone one accomplishes everything up to the finality of parinirvāṇa.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་བསམ་གཏན་ནོ།
en: This is the bodhisattvas’ concentration that is grounded in insight.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་ཆོས་ལྷག་པར་མཐོང་བ་གང་ཞེ་ན།
en: “What is the bodhisattvas’ special insight into phenomena that is grounded in insight?

source: དེས་ཆོས་གང་ལྷག་པར་མཐོང་བ་དེ་དག་ཤེས་རབ་ཀྱི་མིག་ཁོ་ནས་ལྷག་པར་མཐོང་གི།
en: Any phenomena they see are clearly seen by the eye of insight alone.

source: ཤའི་མིག་དང་། ལྷའི་མིག་གིས་ཆོས་དེ་དག་ལྷག་པར་མཐོང་བ་མ་ཡིན་ནོ།
en: However, these phenomena cannot be clearly seen by either the physical or divine eye.

source: །དེ་དག་ཞི་བ་ཁོ་ནར་ལྷག་པར་མཐོང་གི་མ་ཞི་བར་ལྷག་པར་མཐོང་བ་མ་ཡིན་ནོ།
en: They are only clearly seen to be peace, and never as anything other than peace.

source: །དེ་བཞིན་དུ་ཆོས་རྣམས་རྒྱུ་བ་མེད་པ་དང་། གནས་པ་མེད་པ་དང་། དབེན་པ་དང་། ཡོངས་སུ་གྲུབ་པ་མེད་པར་ལྷག་པར་མཐོང་ངོ་།
en: Likewise, phenomena are clearly seen to be still, nonpersisting, void, and unreal.

source: །དེ་ལྟར་མཐོང་བ་གང་ཡིན་པ་དེ་ནི་ཆོས་ཐམས་ཅད་ལྷག་པར་མཐོང་བའོ།
en: Such seeing is clearly seeing all phenomena.

source: །དེས་ཆོས་ཐམས་ཅད་ལྷག་པར་མཐོང་བ་ནི། གལ་ཏེ་ཆོས་འགའ་ཞིག་མཐོང་ན་ནི་ལྷག་མཐོང་མ་ཡིན་ཏེ།
en: Given that they clearly see all phenomena in this way, if they were to see any phenomenon, that would not be special insight.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: ཆོས་མཐོང་བས་ནི་ལྷག་མཐོང་སྐྱེས་པ་མ་ཡིན་ལ། ཤེས་པ་ནི་མི་ཤེས་པ་ཡིན་པའི་ཕྱིར་རོ།
en: Because special insight does not arise from seeing phenomena, and knowing them is ignorance.

source: །མ་མཐོང་བ་ནི་ཆོས་ལྷག་པར་མཐོང་བ་ཡིན་ལ།
en: Not seeing them is special insight into phenomena.

source: བདག་མ་མཐོང་བ་དང་། སེམས་ཅན་མ་མཐོང་བ་དང་། སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་མ་མཐོང་བ་ནི་ཆོས་ལྷག་པར་མཐོང་བ་ཡིན་ཏེ།
en: Not seeing the self, being, life force, soul, person, or individual is special insight into phenomena.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཆོས་དེ་དག་ཀྱང་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་ལ། སེམས་ཅན་རྣམས་ཀྱང་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པར་མཐོང་ནས། དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཀྱེ་མ་ཆོས་འདི་དག་ནི་འདི་ལྟར་དག་ན་སེམས་ཅན་འདི་དག་ནི། ཀུན་ནས་ཉོན་མོངས་སོ་སྙམ་ནས་སེམས་ཅན་རྣམས་ལ་ཆེས་བརྟེན་པར་སྙིང་རྗེ་ཆེན་པོ་སྐྱེའོ། །དེ་བས་ན་དེ་སེམས་ཅན་རྣམས་རབ་ཏུ་གྲོལ་བར་བྱ་བའི་ཕྱིར།
en: Therefore, because bodhisattvas see such phenomena accurately and beings see them mistakenly, bodhisattvas think, ‘Alas, beings are afflicted because they think phenomena are like this.’ They generate great compassion for such beings, and they develop great love for beings in order to liberate them.

source: སྙིང་བརྩེ་བ་ཆེན་པོ་སྐྱེད་དོ། །སེམས་ཅན་དེ་དག་ཀྱང་རྟག་ཏུ་སེམས་ཅན་མེད་པ་ཁོ་ན་སྟེ། འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་ཆོས་ལྷག་པར་མཐོང་བའོ།
en: Thus, knowing that even these beings have never existed is the bodhisattvas’ special insight into phenomena that is grounded in insight.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་གནས་ལ་གནས་པའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་གང་ཞེ་ན།
en: “How do bodhisattvas ripen beings while grounded in insight?

source: ཀླུའི་བདག་པོ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་སེམས་ཅན་མེད་པའི་ཕྱིར། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Nāga Lord, regarding this, bodhisattvas can ripen beings because beings do not exist.

source: །སེམས་ཅན་བདག་མེད་པ་དང་། སེམས་ཅན་ལ་སེམས་ཅན་མེད་པ་དང་། སེམས་ཅན་དབེན་པ་དང་། སེམས་ཅན་རང་བཞིན་གྱིས་སེམས་ཅན་དུ་བརྗོད་པ་ཙམ་དུ་ཟད་པ་དང་། སེམས་ཅན་དུ་གདགས་པ་ཙམ་དུ་ཟད་པ་དང་། སེམས་ཅན་སྟོང་པ་དང་། སེམས་ཅན་མཚན་མ་མེད་པ་དང་། སེམས་ཅན་སྨོན་པ་མེད་པ་དང་། སེམས་ཅན་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་དང་། སེམས་ཅན་ཇི་ལྟ་བ་བཞིན་མ་ཡིན་པ་དང་། སེམས་ཅན་མ་སྐྱེས་པ་དང་། སེམས་ཅན་མ་བྱུང་བ་དང་། སེམས་ཅན་རྣམ་པར་དག་པའི་ཕྱིར་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། དེ་ཡང་བདག་གཞིག་པའི་ཕྱིར་མ་ཡིན། སེམས་ཅན་གཞིག་པའི་ཕྱིར་མ་ཡིན།
en: They can ripen beings because beings are selfless, beings are not beings, beings are void, beings are by their nature merely described as and imputed to be beings, beings are empty, beings are devoid of marks, beings are devoid of wishes, beings are devoid of performance, beings are not consistent with reality, beings are unborn, beings are unarisen, and beings are pure.

source: སྲོག་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་གཞིག་པའི་ཕྱིར་མ་ཡིན། དངོས་པོ་གཞིག་པའི་ཕྱིར་མ་ཡིན།
en: Bodhisattvas do not ripen beings in order to destroy the self, being, life principle, soul, personhood, individuality, existence, or substance.

source: རྫས་གཞིག་པའི་ཕྱིར་མ་ཡིན་གྱི། ཀླུའི་བདག་པོ་སེམས་ཅན་དེ་དག་གི་ངོ་བོ་ཉིད་ཇི་ལྟ་བ་དེ་ཁོ་ན་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: Rather, Nāga Lord, they ripen beings only according to their essential nature.

source: །སེམས་ཅན་རྣམས་ཀྱི་ངོ་བོ་ཉིད་ཇི་ལྟ་བུ་ཞེ་ན།
en: “What is the essential nature of beings?

source: འདི་ལྟ་སྟེ། རང་བཞིན་གྱིས་བདག་མེད་པའི་ངོ་བོ་ཉིད་ནི་ངོ་བོ་ཉིད་མེད་པའོ།
en: Their essential nature is naturally selfless and without essential nature.

source: །ངོ་བོ་ཉིད་མེད་པ་ནི་སེམས་ཅན་རྣམས་ཀྱི་ངོ་བོ་ཉིད་དོ།
en: Having no essential nature is the essential nature of beings.

source: །སེམས་ཅན་རྣམས་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པའི་ངོ་བོ་ཉིད་དེ་ཉིད་ནི།
en: The essential nature that is the essential nature of beings is also the essential nature of all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དོ། །ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་གང་ཡིན་པ་དེ་ཉིད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་དེ།
en: The essential nature of all phenomena is also the essential nature of all the qualities of buddhahood.

source: དེ་བས་ན་ཆོས་ཐམས་ཅད་ནི་སངས་རྒྱས་ཀྱི་ཆོས་ཞེས་བྱའོ།
en: Therefore, all phenomena are said to be qualities of buddhahood.

source: །ཀླུའི་བདག་པོ་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་ནི་མིང་ཙམ་དུ་ཟད་དེ།
en: Nāga Lord, what we call ‘all phenomena’ is just a name.

source: མིང་དེ་ཡང་མིང་དུ་མི་དམིགས་སོ།
en: That name cannot be observed as a name.

source: །ཀླུའི་བདག་པོ་ཆོས་ཐམས་ཅད་ཅེས་བྱ་བ་བསྟན་པ་ནི་ཆོས་མ་ཡིན་པ་བསྟན་པ་ཡིན་ནོ།
en: Nāga Lord, to refer to them as ‘all phenomena’ is to indicate that they are not phenomena.

source: ཅི་ཙམ་དུ་ཆོས་ཐ་དད་དུ་བྱེད་པ་དེ་ཙམ་དུ་ཆོས་མ་ཡིན་པའི་ཕྱིར་རོ།
en: To whatever extent phenomena are differentiated, to that extent they are not phenomena.

source: །དེ་ལ་ཆོས་གང་བརྗོད་པ་དེ་དག་ཐམས་ཅད་ནི་ཆོས་མ་ཡིན་པ་ཁོ་ནའོ།
en: Along these lines, any phenomenon that can be referred to cannot actually be a phenomenon.

source: །ཀླུའི་བདག་པོ་ཆོས་ཉིད་དང་ཆོས་ཀྱི་དབྱིངས་ནི་རང་བཞིན་གྱིས་བརྗོད་པའམ་སྨྲ་བར་མི་ནུས་ཏེ།
en: Nāga Lord, the nature of phenomena and the realm of phenomena are such that one cannot describe or speak of them.

source: འདི་ལྟར་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་བརྗོད་དུ་མེད་པ་དང་། ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་ཅན་ཡིན་ཏེ།
en: Just as the nature of the realm of phenomena is indescribable, all phenomena have the nature of the realm of phenomena.

source: དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་བརྗོད་པར་མི་ནུས་སོ།
en: Therefore, phenomena cannot be described.

source: །ཀླུའི་བདག་པོ་སངས་རྒྱས་ཀྱི་ཆོས་འདི་དག་ནི་རྣམ་གྲངས་འདི་དང་ཚུལ་འདིས་བསྟན་མོད་ཀྱི།
en: Nāga Lord, these qualities of buddhahood are described with this explanation and in this manner.

source: འོན་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་དེ་དག་ནི་སྒྲའི་རྣམ་པར་རིག་པར་བྱེད་ཀྱིས་རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན་ནོ།
en: However, these qualities of buddhahood cannot be communicated by such descriptive language.

source: །ཀླུའི་བདག་པོ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནི་འདུས་བྱས་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་རྣམས་ཀྱིས་རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན། གདགས་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Nāga Lord, the qualities of buddhahood cannot be conveyed or labeled by means of conditioned and unconditioned phenomena.

source: ཀླུའི་བདག་པོ་འདུས་བྱས་དང་། འདུས་མ་བྱས་ལ་མ་གཏོགས་པར་གང་གཞན་དུ་བགྲང་དུ་རུང་བའི་ཆོས་ཅི་ཡང་མེད་དོ། །གསོལ་པ།
en: Nāga Lord, there are no phenomena whatsoever apart from those counted among the conditioned and unconditioned.”

source: བཅོམ་ལྡན་འདས་འོ་ན་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་འདུས་མ་བགྱིས་པ་ལགས་སམ།
en: “If that is the case, Blessed One, are the qualities of buddhahood unconditioned?

source: དེ་བཞིན་གཤེགས་པ་ཡང་དེ་ལྟ་བུ་ལགས་སམ།
en: Are the thus-gone ones also like this?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: The Blessed One answered, “Yes they are, Nāga Lord, yes they are.

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་འདུས་མ་བྱས་པའོ།
en: The qualities of buddhahood are unconditioned.

source: །དེ་བཞིན་གཤེགས་པ་ཡང་འདུས་མ་བྱས་པའོ།
en: The thus-gone ones are also unconditioned.

source: །ཀླུའི་བདག་པོ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། འདུས་མ་བྱས་པ་ལ་གདགས་པ་ཅི་ཡང་ཡོད་དམ།
en: Nāga Lord, do you think there is anything that can be labeled as unconditioned?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: “No, Blessed One, there is not.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀླུའི་བདག་པོ་རྣམ་གྲངས་འདིས་ཀྱང་ཁྱོད་ཀྱིས་ཇི་ལྟར་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན་པ་དང་། གདགས་པར་བྱ་བ་མ་ཡིན་པ་དེ་ལྟར་རིག་པར་བྱའོ།
en: The Blessed One continued, “Nāga Lord, through this explanation you should understand how the qualities of buddhahood defy communication and labeling.

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲའོ།
en: All phenomena are in this way the same as the qualities of buddhahood.

source: །ཀླུའི་བདག་པོ་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་ཇི་ཙམ་དུ་བསྟན་པ་ལ་ལྟོས། འདི་ལྟར་རྣམ་པར་རིག་པར་བྱ་བ་མ་ཡིན་པ་དང་། གདགས་པར་བྱ་བ་མ་ཡིན་པའི་ཆོས་རྣམས་མིང་དང་བརྡས་འདོགས་པར་མཛད་དེ། ཆོས་འདི་དག་ནི་ཟག་པ་དང་བཅས་པའོ།
en: Still, Nāga Lord, consider how the Thus-Gone One compassionately teaches beings by ascribing names and definitions to phenomena that defy communication and labeling.

source: །ཆོས་འདི་དག་ནི་ཟག་པ་མེད་པའོ། །དེ་བཞིན་དུ་འཇིག་རྟེན་པ་རྣམས་དང་། འཇིག་རྟེན་ལས་འདས་པ་རྣམས་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་རྣམས་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་རྣམས་དང་། འདུས་བྱས་རྣམས་དང་། འདུས་མ་བྱས་རྣམས་དང་། ཀུན་ནས་ཉོན་མོངས་པའི་ཕྱོགས་དང་འཐུན་པ་རྣམས་དང་། རྣམ་པར་བྱང་བའི་ཕྱོགས་དང་འཐུན་པ་རྣམས་དང་། བསྟེན་པར་བྱ་བ་རྣམས་དང་། ཡོངས་སུ་སྤང་བར་བྱ་བ་རྣམས་དང་། གདགས་པར་བྱ་བ་རྣམས་དང་། གཞིག་པར་བྱ་བ་རྣམས་དང་། སོ་སོའི་སྐྱེ་བོའི་ཆོས་རྣམས་དང་། སློབ་པའི་ཆོས་རྣམས་དང་། མི་སློབ་པའི་ཆོས་རྣམས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་འདོགས་པར་མཛད་དེ།
en: Thus I will say, ‘these phenomena are defiling’ and ‘those phenomena are undefiling.’ Likewise, reference is made to worldly things, transcendent things, evil things, good things, conditioned things, unconditioned things, things that pertain to pollution, things that pertain to purification, things that should be attended to, things that should be abandoned, things that should be imputed, things that should be analyzed, qualities of ordinary beings, qualities of learning, qualities of no more learning, qualities of solitary buddhas, qualities of bodhisattvas, and qualities of buddhas.

source: ཀླུའི་བདག་པོ་དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ནི་དེ་ལྟར་ཆོས་རྣམ་པར་གཞག་པ་བསྟན་པ་ཡང་སྟོན་པར་མཛད་ལ། ཆོས་གང་ལ་ཡང་མཚན་མར་ཡང་དག་པར་རྗེས་སུ་མི་གཟིགས་སོ།
en: “Nāga Lord, this being so, while the Thus-Gone One gives teachings presenting phenomena in this manner, no phenomena are genuinely seen anywhere in the form of marks.

source: །ཀླུའི་བདག་པོ་དཔེར་ན་མི་ལ་ལ་ཞིག་སྐྱེས་ལ། དེས་ནམ་མཁའི་ཁམས་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པ་འདི་ལ་ཚོན་རྩི་ཐམས་ཅད་ཀྱིས་རི་མོར་བྲིས་ཏེ།
en: To give an analogy, Nāga Lord, imagine a person were able to paint many colorful images upon formless and indescribable space.

source: ལྷའི་གཟུགས་རྣམས་ཀྱང་དེར་བསྟན། མིའི་གཟུགས་རྣམས་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། དཔུང་བུ་ཆུང་དང་། བཞོན་པ་རྣམས་ཀྱང་དེར་བསྟན་ན།
en: That person could paint divine bodies, human bodies, horses, elephants, chariots, foot soldiers, and mounts there.

source: ཀླུའི་བདག་པོ་འདི་ཇི་སྙམ་དུ་སེམས། ཅི་མི་དེ་དཀའ་བ་བྱེད་པ་ཡིན་ནམ། གསོལ་པ།
en: Now, tell me, Nāga Lord, has this person done something difficult?”

source: བཅོམ་ལྡན་འདས་དཀའ་བ་བགྱིད་པ་ལགས་སོ།
en: “Blessed One, it would be difficult.

source: །བདེ་བར་གཤེགས་པ་དཀའ་བ་བགྱིད་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blissful One, it would be difficult indeed.”

source: ཀླུའི་བདག་པོ་དེ་བས་ན་གང་གཟུགས་མེད་ཅིང་བསྟན་དུ་མེད་པ། གཟུང་དུ་མེད་པ། ཡི་གེ་མེད་པ། བརྗོད་དུ་མེད་པའི་ཆོས་འདི་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་རྣམས་ལ་བརྡ་སྤྲད་ཅིང་ཡི་གེ་རྣམས་ཀྱིས་མཚོན་ཏེ། ཐབས་སྣ་ཚོགས་ཀྱིས་གོ་བར་བྱས་པ་དེ།
en: The Blessed One continued, “Therefore, Nāga Lord, this Dharma that is formless, indescribable, ungraspable, beyond language, and unutterable is illustrated for other beings and individuals with communication and letters so that it is conveyed through various methods.

source: དེ་བཞིན་གཤེགས་པས་ཆེས་དཀའ་བ་མཛད་པ་ཡིན་ནོ།
en: In doing so, the Thus-Gone One is doing something very difficult.

source: །ཀླུའི་བདག་པོ་དེ་བས་ཀྱང་གང་དག་འདི་ལྟར་བསྟན་པའི་ཆོས་འདི་དག་ལ་མོས་པར་འགྱུར་བའམ། འཇུག་པར་འགྱུར་བ་དེ་དག་ནི་ཆེས་ངོ་མཚར་ཆེ་བ་བྱེད་པ་ཡིན་ནོ།
en: Still, Nāga Lord, compared to that, whoever is inspired by and takes up these teachings being described here is doing something even more incredible.

source: །ཀླུའི་བདག་པོ་གཞན་ཡང་ཟབ་མོའི་ཚུལ་འདི་ལ་འཇུག་པའི་སེམས་ཅན་གང་ཡིན་པ་དེ་དག་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་ཡིན་ཏེ།
en: Nāga Lord, furthermore, any being that enters this profound way has trained with previous thus-gone ones.

source: དེ་དག་ལ་ནི་བདུད་སྡིག་ཅན་གྱིས་ཀྱང་གླགས་མི་རྙེད་དོ།
en: The evil māras have found no opportunity to impact them.

source: །ཀླུའི་བདག་པོ་ངས་མངོན་པར་ཤེས་པ་འདས་པའི་དུས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་པ་ངས་མཉེས་པར་བྱས་ཏེ། མཆོད་པ་ཡང་བྱས། དེ་དག་གི་བསྟན་པ་ལ་ཡང་ང་རབ་ཏུ་བྱུང་སྟེ། ཚངས་པར་སྤྱོད་པ་ཡང་སྤྱད་ན།
en: Nāga Lord, I remember that previously I served countless blessed buddhas and venerated them, went forth in their teachings, and practiced pure conduct with them.

source: འོན་ཀྱང་དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ང་ལ་འདི་ལྟར་ཟབ་ཅིང་འདི་ལྟར་རྒྱུ་བ་ཆད་པའི་ཆོས་མ་བསྟན་ཏེ།
en: Yet those thus-gone ones did not teach me this profound Dharma that eliminates movement.

source: གཞན་དུ་ན་སྦྱོར་བའི་གཏམ་ཉི་ཚེ་དང་། སྦྱིན་པ་དང་། དུལ་བ་དང་། ལེགས་པར་སྡོམ་པ་དང་། དེས་པའི་གཏམ་ཉི་ཚེ་དང་། ཚུལ་ཁྲིམས་དང་། ཐོས་པ་དང་། གཏོང་བ་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་དང་། བག་ཡོད་པའི་གཏམ་ཉི་ཚེ་དང་། ཚངས་པར་སྤྱད་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་ཡོ་བྱད་བསྙུངས་པའི་གཏམ་ཉི་ཚེ་བསྟན་ཏོ།
en: Rather, they taught the minor preliminary subjects, generosity, restraint, vows, gentility, discipline, learning, giving, patience, diligence, carefulness, pure conduct, ascetic practices, and voluntary poverty.

source: འདི་ལྟར་ཡོངས་སུ་སྦྱང་བ་མ་བྱས་པའི་ཕྱིར་རོ།
en: Because I had not undergone prior training.

source: །ཀླུའི་བདག་པོ་གང་གི་ཚེ་ང་ཡོངས་སུ་སྦྱང་བ་བྱས་པར་གྱུར་པ་དེའི་ཚེ་ནི་ངས་དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཆེན་པོ་ལས་ཟབ་མོའི་ཆོས་ཀྱི་ཚུལ་འདི་ཐོས་སོ།
en: “However, Nāga Lord, once I had gone through prior training, I heard this profound Dharma teaching from the Thus-Gone One Mahādīpaṃkara.

source: །ཐོས་ནས་ཀྱང་ང་འཐུན་པའི་ཆོས་རྣམས་ལ་བཟོད་པ་སྐྱེས་སོ།
en: Having heard it, I developed the acceptance of phenomena concurring with reality.
